print(2**2002%15)
#Найти остаток от деления: 2^2002 на 15
