Откройте файл электронной таблицы, содержащей в каждой строке семь натуральных чисел. Определите количество строк таблицы, содержащих числа, для которых выполнены оба условия:

— среди семи чисел совпадают ровно четыре числа;

— среднее значение повторяющихся чисел больше чем среднее арифметическое неповторяющихся чисел строки.

В ответе запишите только число и прикрепите файл с кодом программы. Только числовой ответ на задачу, решение с помощью электронных таблиц принесет вам 50% от полного балла за задание. 

Вложения с решением обязательны. 
Файл к задаче

Или заберите файлы по ссылке: https://github.com/pchelintseva-1581/KKR-10IT-summer.git
f=open("1.csv")
ans=0
for x in f:
    sum1=0
    sum2=0
    z=x.split(";")
    for i in range(len(z)):
        z[i]=int(z[i])
    d=[]
    for j in z:
        d.append(z.count(j))
    if d.count(4)==4 and d.count(1)==3:
        for i in range(len(z)):
            if d[i]==4:
                sum1+=z[i]
            if d[i]==1:
                sum2+=z[i]
        if sum1/4>sum2/3:
            ans+=1
print(ans)